chore: use mermaid diagram
